6/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;
maxAlphaCo      1;

maxDeltaT       1;


// ************************************************************************* //

functions
{

water_in_domain
{
    type            volFieldValue;
    functionObjectLibs ("libfieldFunctionObjects.so");
    enabled         true;

    writeFields off;

    //writeControl     outputTime;
    writeControl   timeStep;
    writeInterval  1;

    log             true;

    regionType      all;

    operation       volIntegrate;
    fields
    (
        alpha.water
    );
}

probes1
{
    type probes;
    functionObjectLibs ("libsampling.so");
    //dictionary probesDict;
    probeLocations
    (
	(0.1 0.1 0.01)
	(0.2 0.1 0.01)
	(0.3 0.1 0.01)
    );

    fields
    (
	alpha.water
    );

    writeControl       timeStep;
    writeInterval      1;
}


}

